import re

GROUP_ID = 196466218
TOKEN = 'fbb7992b819c85b3a69896ea95481856553983c99bb8f4f70e1c45dcad5affa7df6be2fa7645f0c964066'


IVENTS = [
    {
        'name': 'Дата проведения',
        'tokens': ('спасибо',),
        'scenario': None,
        'answer': 'Люблю тебя ♥'
    },
    {
        'name': 'Место проведения',
        'tokens': (),
        'scenario': None,
        'answer': 'Конференция пройдет над открытом небом'
    },
    {
        'name': 'Регистрация',
        'tokens': ('подъезд','подьезд','подезд',),
        'scenario': 'reqistration',
        'answer': None
    },
]

SCENARIOS = {
    'reqistration' : {
        'first_step' : 'step1',
        'steps' : {
            'step1':{
                'text': 'Павильно! 🎉\n\n'
                        'Кстати, насчет подъезда, одевайтесь, Вам туда! 💃',
                'failure_text': 'Хмм... Нужно подумать.',
                'handler': 'handle_name',
                'next_step' : 'step2'
            },
            'step2': {
                'text': 'Вы нашли послание от ... \n'
                        'Хм... От кого же? Ладно, это неважно.\n\n'
                        'Мы задержали разведчика! Но она ничего не хочет рассказывать. У неё точно что-то есть!\n\n'
                        'Может Ваше Высочество займется этим?\n'
                        'Вы найдете разведчика в замке. Её имя - Саша!',
                'failure_text': 'Скажите что Вы из неё смогли выбить!',
                'handler': 'handle_email',
                'next_step': 'step3'
            },
            'step3': {
                'text': 'Отлично!\n\n'
                        'Вы хорошо справляетесь с ролью госпожи!\n\n'
                        'Пока вы допрашивали разведчика, нам сообщили, что на улицах нашего королевства творится что-то странное. Вам срочно нужно всё разузнать!',
                'failure_text': 'Посмотрите там, где ваш слуга обычно Вас ждет!',
                'handler': 'milka',
                'next_step': 'step4'
            },
            'step4': {
                'text': 'ВНИМАНИЕ\n\n\n'
                        'Кто-то прислал нам фото! Что бы это могло значить?',
                'failure_text': 'Думаю, стоит проверить это место. \n'
                                'Может это угроза?',
                'handler': 'beer',
                'next_step': 'step5'
            },
            'step5': {
                'text': 'Вы настоящая королева! 🖤 \n '
                        'Я восхищаюсь Вами! Ваши глаза вслеют надежду, я счастлив находиться рядом с такой величественной девушкой!\n\n'
                        'Вы выполнили все свои обязаности на сегодня, можете отдохнуть!',
                'failure_text': 'На сегодня дел нет, принцесаа 👑' ,
                'handler': 'more',
                'next_step': 'step6'
            }
        }
    }
}

DEFAULT_ANSWER = 'Вы руководите целым королевством, неужели Вы не можете понять это? \n Подумайте ещё!'


